9/data/attachments/6a6883551c8b3b8f.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_cc45c340-44e2-4cca-b933-4a428ae8bc28</nif:username>
            <nif:friendToBeAdded>William_arm_Friend_18292_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>